#                    Задание 1.
# Пользователь делает вклад в размере a рублей сроком на years лет под 10% годовых
# (каждый год размер его вклада увеличивается на 10%.
# Эти деньги прибавляются к сумме вклада, и на них в следующем году тоже будут проценты)
# Написать функцию bank, принимающая аргументы a и years, и
# возвращающую сумму, которая будет на счету пользователя
def bank(a, years):
    for i in range(0, years):
        a *= 1.1
        print(i + 1, "год - %.3f" % a)
    return a
    # i = 0
    # while i < years:
    #     a *= 1.1
    #     i += 1
    #     print(i, "год - %.3f" % a)
    # return a


a = float(input("Вклад = "))
years = int(input("Срок = "))
print("Счёт = %.2f" % bank(a, years))

